Revit 2024 API
UIDocument.GetOpenUIViews Method
Get a list of all open view windows in the Revit user interface.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<UIView> GetOpenUIViews()
Visual Basic
Public Function GetOpenUIViews As IList(Of UIView)
Visual C++
public:
IList<UIView^>^ GetOpenUIViews()
Remarks
A sheet view with an activated viewport will return the view associated with the activated viewport, not the sheet view.
See Also
UIDocument Class
Autodesk.Revit.UI Namespace